# Используем официальный образ Node.js в качестве базового образа
FROM node:14

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы package.json и package-lock.json и устанавливаем зависимости
COPY package*.json ./
RUN npm install

# Копируем все файлы в текущей директории внутрь контейнера
COPY . .

# Собираем приложение
RUN npm run build

# Указываем порт, который будет использоваться приложением
EXPOSE 3000

# Команда для запуска приложения при старте контейнера
CMD ["npm", "start"]
